import pyfiglet
ascii_art = """
     _    ____   ____ ___ ___    ____ _____ _   _ _____ ____      _  _____ ___  ____  
    / \  / ___| / ___|_ _|_ _|  / ___| ____| \ | | ____|  _ \    / \|_   _/ _ \|  _ \ 
   / _ \ \___ \| |    | | | |  | |  _|  _| |  \| |  _| | |_) |  / _ \ | || | | | |_) |
  / ___ \ ___) | |___ | | | |  | |_| | |___| |\  | |___|  _ <  / ___ \| || |_| |  _ < 
 /_/   \_\____/ \____|___|___|  \____|_____|_| \_|_____|_| \_\/_/   \_\_| \___/|_| \_\ 
                                                                                                         
"""
print(ascii_art)
while True:
    # Введите текст, который вы хотите преобразовать в ASCII-текст
    text = input("Введите текст: ")

    if text.lower() == '██':
        break

    # Используйте библиотеку pyfiglet для создания стандартного ASCII-текста
    ascii_text = pyfiglet.figlet_format(text)

    # Выведите полученный ASCII-текст
    print(ascii_text)
